[
    {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms",
    "id": 1,
    "description": "WhatsApp is one of the world’s most widely used messaging platforms that makes it easy to stay connected with friends, family, colleagues, and communities across the globe. With this app, you can send instant text messages, photos, videos, documents, voice recordings, and even your live location. It offers free, high-quality voice and video calls, allowing you to communicate with people no matter where they are. WhatsApp also supports group chats, broadcast lists, and communities to keep everyone connected in one place. Security is a top priority, and with end-to-end encryption, every chat and call remains private and secure. In addition to the mobile app, WhatsApp Web and Desktop versions allow you to seamlessly continue conversations on your computer. Whether you’re communicating personally or professionally, WhatsApp provides a fast, reliable, and safe platform for everyday conversations.It offers free, high-quality voice and video calls, allowing you to communicate with people no matter where they are. WhatsApp also supports group chats, broadcast lists, and communities to keep everyone connected in one place. Security is a top priority, and with end-to-end encryption, every chat and call remains private and secure. In addition to the mobile app, WhatsApp Web and Desktop versions allow you to seamlessly continue conversations on your computer.It offers free, high-quality voice and video calls, allowing you to communicate with people no matter where they are. WhatsApp also supports group chats, broadcast lists, and communities to keep everyone connected in one place. Security is a top priority, and with end-to-end encryption, every chat and call remains private and secure. In addition to the mobile app, WhatsApp Web and Desktop versions allow you to seamlessly continue conversations on your computer. In addition to the mobile app, WhatsApp Web and Desktop versions allow you to seamlessly continue conversations on your computer.It offers free, high-quality voice and video calls, allowing you to communicate with people no matter where they are. WhatsApp also supports group chats, broadcast lists, and communities to keep everyone connected in one place. In addition to the mobile app, WhatsApp Web and Desktop versions allow you to seamlessly continue conversations on your computer.It offers free, high-quality voice and video calls, allowing you to communicate with people no matter where they are. WhatsApp also supports group chats, broadcast lists, and communities to keep everyone connected in one place.",
    "size": 42,
    "reviews": 150,
    "ratingAvg": 4.6,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "id": 2,
    "description": "Instagram is a powerful social networking platform focused on visual content where users can share their moments through photos, videos, reels, and stories. It allows you to creatively express yourself using filters, editing tools, and music while building connections with friends, family, and communities. Instagram offers multiple ways to interact, such as direct messaging, comments, likes, and live streams. The platform is also widely used by influencers, creators, and businesses to promote products, showcase talents, and grow audiences. Reels provide a fun, short-form video experience, while stories disappear in 24 hours, making interactions more dynamic. Instagram’s Explore page helps you discover new trends, creators, and content based on your interests. With billions of users, it is one of the leading apps for entertainment, networking, and inspiration. Instagram offers multiple ways to interact, such as direct messaging, comments, likes, and live streams. The platform is also widely used by influencers, creators, and businesses to promote products, showcase talents, and grow audiences. Reels provide a fun, short-form video experience, while stories disappear in 24 hours, making interactions more dynamic. Instagram offers multiple ways to interact, such as direct messaging, comments, likes, and live streams. The platform is also widely used by influencers, creators, and businesses to promote products, showcase talents, and grow audiences. Reels provide a fun, short-form video experience, while stories disappear in 24 hours, making interactions more dynamic. Instagram offers multiple ways to interact, such as direct messaging, comments, likes, and live streams. The platform is also widely used by influencers, creators, and businesses to promote products, showcase talents, and grow audiences. Reels provide a fun, short-form video experience, while stories disappear in 24 hours, making interactions more dynamic.",
    "size": 48,
    "reviews": 180,
    "ratingAvg": 4.4,
    "downloads": 300,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 9700000 }
    ]
  },
   {
    "image": "https://img.freepik.com/premium-vector/vinnytsia-ukraine-april-29-2023-popular-social-media-logo-pinterest-icon-vector-design-realistic-editorial-sign_545793-1686.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 3,
    "description": "Pinterest is a visual discovery and idea-sharing platform where millions of users explore inspiration for hobbies, interests, and lifestyle needs. From recipes and home décor to fashion, DIY crafts, travel, and event planning, Pinterest provides endless ideas through 'pins' that users can save and organize into boards. The platform acts as a digital vision board where people can plan projects, find creative solutions, or simply explore trending topics. Businesses and content creators use Pinterest to reach new audiences, showcase their products, and drive website traffic. The app is highly visual and user-friendly, making it perfect for anyone looking to discover fresh inspiration and collect ideas in an organized way. With its vast collection of creative content, Pinterest continues to be a go-to hub for discovery and planning.  The platform acts as a digital vision board where people can plan projects, find creative solutions, or simply explore trending topics. Businesses and content creators use Pinterest to reach new audiences, showcase their products, and drive website traffic.  The platform acts as a digital vision board where people can plan projects, find creative solutions, or simply explore trending topics. Businesses and content creators use Pinterest to reach new audiences, showcase their products, and drive website traffic.  The platform acts as a digital vision board where people can plan projects, find creative solutions, or simply explore trending topics. Businesses and content creators use Pinterest to reach new audiences, showcase their products, and drive website traffic.  The platform acts as a digital vision board where people can plan projects, find creative solutions, or simply explore trending topics. Businesses and content creators use Pinterest to reach new audiences, showcase their products, and drive website traffic.  The platform acts as a digital vision board where people can plan projects, find creative solutions, or simply explore trending topics. Businesses and content creators use Pinterest to reach new audiences, showcase their products, and drive website traffic.",
    "size": 50,
    "reviews": 700,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 3300000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/018/930/704/non_2x/snapchat-logo-snapchat-icon-transparent-free-png.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 4,
    "description": "Snapchat is a unique and entertaining multimedia messaging app that lets you capture photos and videos, known as 'snaps,' and share them with friends instantly. What makes Snapchat different is that snaps disappear after being viewed, encouraging more authentic and spontaneous communication. Users can add creative filters, fun stickers, augmented reality lenses, and effects to make their snaps stand out. The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment, Snapchat has become a favorite app for casual interactions, playful expression, and real-time sharing.  The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment  The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment  The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment  The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment  The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment  The app also features stories, spotlight, group chats, and streaks to keep people connected in engaging ways. Alongside snapping, Snapchat offers video and voice calling, Bitmoji avatars, and personalized highlights. With its youthful and creative environment",
    "size": 38,
    "reviews": 800,
    "ratingAvg": 4.2,
    "downloads": 200,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/19/Spotify_logo_without_text.svg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 5,
    "description": "Spotify is a leading music and podcast streaming service that provides access to millions of songs and episodes from artists and creators worldwide. Users can create playlists, discover new music through personalized recommendations, and enjoy curated playlists based on mood, activity, or genre. Spotify supports both free and premium versions, with premium offering offline listening, ad-free streaming, and unlimited skips. The app also integrates social features, allowing users to share music, follow friends, and explore what others are listening to. From mainstream hits to indie tracks and exclusive podcasts, Spotify offers a diverse and engaging listening experience for every taste. Spotify supports both free and premium versions, with premium offering offline listening, ad-free streaming, and unlimited skips. The app also integrates social features, allowing users to share music, follow friends, and explore what others are listening to. Spotify supports both free and premium versions, with premium offering offline listening, ad-free streaming, and unlimited skips. The app also integrates social features, allowing users to share music, follow friends, and explore what others are listening to. Spotify supports both free and premium versions, with premium offering offline listening, ad-free streaming, and unlimited skips. The app also integrates social features, allowing users to share music, follow friends, and explore what others are listening to. Spotify supports both free and premium versions, with premium offering offline listening, ad-free streaming, and unlimited skips. The app also integrates social features, allowing users to share music, follow friends, and explore what others are listening to. Spotify supports both free and premium versions, with premium offering offline listening, ad-free streaming, and unlimited skips. The app also integrates social features, allowing users to share music, follow friends, and explore what others are listening to.",
    "size": 56,
    "reviews": 110,
    "ratingAvg": 4.7,
    "downloads": 150,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 7300000 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/youtube-color-icons_1209566-1.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 6,
    "description": "YouTube is the world’s largest video-sharing platform where users can watch, upload, and share videos on virtually any topic. From entertainment, music, gaming, and tutorials to education, vlogs, and live streams, YouTube provides unlimited content created by millions of people worldwide. Users can subscribe to channels, like, comment, and create playlists to organize their favorite content. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. With its powerful recommendation system, YouTube helps users discover new videos and channels suited to their interests, making it a hub for both entertainment and learning. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences. YouTube also offers a premium version with ad-free viewing, offline downloads, and access to YouTube Music. Creators use YouTube to showcase their talents, earn revenue through ads and memberships, and reach global audiences.",
    "size": 60,
    "reviews": 250,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 13900000 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/twitter-new-x-logo-design-vector_1340851-70.jpg",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 7,
    "description": "X (formerly known as Twitter) is a real-time social networking platform where users share short posts called 'tweets.' It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags, and connect with communities of shared interests. Businesses, journalists, politicians, and celebrities use X as a powerful communication tool. With features like Spaces for live audio conversations and subscriptions for premium content, X remains a dynamic platform for discovering what’s happening now. It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags It is widely used to follow news, trends, and conversations happening globally. From breaking news and live sports updates to memes, politics, and personal thoughts, X allows people to express themselves freely and engage in public discussions. Users can like, retweet, and reply to tweets, follow hashtags",
    "size": 45,
    "reviews": 700,
    "ratingAvg": 4.0,
    "downloads": 150,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2600000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Telegram is a fast and secure cloud-based messaging app that offers speed, privacy, and powerful features. It allows users to send unlimited messages, photos, videos, files, and documents of any size. Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences. Telegram is cross-platform, allowing you to access your chats from multiple devices instantly. With its focus on privacy and innovation, Telegram has become a strong alternative to other messaging apps worldwide.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.  Telegram supports group chats with up to hundreds of thousands of members, making it popular for communities, organizations, and businesses. The app offers secret chats with end-to-end encryption, customizable themes, stickers, bots, and channels for broadcasting to large audiences.",
    "size": 39,
    "reviews": 600,
    "ratingAvg": 4.5,
    "downloads": 120,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2900000 }
    ]
  }
]